#+TITLE: NLP Bahasa Indonesia dengan Python
#+AUTHOR: Kholid Fuadi, SE., MSi
#+DATE: <2016-11-17 Thu>
#+STARTUP: indent

*** d. /stop words/
Kata penghubung kalau dalam bahasa Indonesia. Kalau dalam bahasa
Inggris, pustaka ~nltk~ sudah menyediakan daftar /stopwords/ yang
tinggal diunduh, lain halnya dengan Bahasa Indonesia. Kita harus
menambahkan secara manual, beruntung ada beberapa tautan di Internet
yang menyediakan, dan sudah saya unduh di direktori
~dataset~[fn:4]. Mari kita coba terapkan untuk mengidentifikasi kata
penghubung dalam Bahasa Indonesia:

#+BEGIN_SRC python
import os


stopword_file = os.path.join('.', 'dataset/stopword_list_indo.txt')

with open(stopword_file, 'r') as f:
    stopwords = f.read()

stopwords = [i for i in stopwords.split('\n')]
return stopwords[:5]
#+END_SRC

#+RESULTS:
| ada | adalah | adanya | adapun | agak | 

Sekarang mari gunakan untuk mengidentifikasi kata penghubung dalam
kalimat berikut:

#+BEGIN_SRC python
import os
from nltk.tokenize import word_tokenize


# reading stopword_list_indo.txt
stopword_file = os.path.abspath(os.path.join('.',
                                             'dataset/stopword_list_indo.txt'))
with open(stopword_file, 'r') as f:
    stopwords = f.read()

stopwords = [i for i in stopwords.split('\n')]

teks = "Semenjak dihadang warga ketika kampanye, Ahok sekarang sering \
melakukan kegiatan kampanye di poskonya."

words = word_tokenize(teks)

filtered_sentence = [w for w in words if not w in stopwords]
print filtered_sentence
#+END_SRC

Hasilnya:

#+BEGIN_SRC python
['Semenjak', 'dihadang', 'warga', 'kampanye', ',', 'Ahok', 'kegiatan',
'kampanye', 'poskonya', '.']
#+END_SRC

Terlihat bahwa kata ~sekarang~, ~ketika~, ~sering~, ~melakukan~ dan
~di~ dianggap sebagai kata penghubung sehingga dihilangkan dari
~teks~. Inilah salah satu contoh proses /tokenization/ dan
membersihkan teks dari kata penghubung.

